In [1]:
import pandas as pd

In [11]:
import numpy as np

In [2]:
a = ['0000','000000','1111','2222']

In [3]:
df = pd.DataFrame()

In [4]:
df['col1'] = a

In [8]:
df['col2'] = df['col1'].apply(lambda x: 1 if len(x) <5 else 0)

In [12]:
df['col3'] = np.where(df['col1'].str.len()>4,1,0)

In [13]:
df

     col1  col2  col3
0    0000     0     0
1  000000     1     1
2    1111     0     0
3    2222     0     0

In [14]:
df.loc[df['col3']==1]

     col1  col2  col3
1  000000     1     1